/*
hw5：大數加法
給定兩個長度為 l(1<=l<=1000)的數字（但型態為字串），請回傳兩個數字相加後的結果。
提示：小時候怎麼做直式加法，這一題就怎麼做
"123"+"456" => "579"
"12312383813881381381"+"129018313819319831" => "12441402127700701212"
*/

//1.變數為字串
//1-1.把字串變數字
//2.for迴圈把字串每個index提出來相加
//3.if判斷相加是否超過10進位到下一位數

import {toAdd} from './hw1-5'

describe('測驗', () =>{
    it('it should be 101', () => {
        expect(toAdd('27', '74')).toBe('101')
    })

    it('it should be 1024', () => {
        expect(toAdd('1006', '18')).toBe('1024')
    })

    it('it should be 777', () => {
        expect(toAdd('88', '689')).toBe('777')
    })
})

